<html><head><meta content="text/html; charset=UTF-8" http-equiv="content-type"><style type="text/css">@import url('https://themes.googleusercontent.com/fonts/css?kit=lhDjYqiy3mZ0x6ROQEUoUw');ul.lst-kix_gy8hznkx569v-5{list-style-type:none}.lst-kix_2z6b1ga5h3yk-4>li:before{content:"\0025cb  "}ul.lst-kix_gy8hznkx569v-4{list-style-type:none}ul.lst-kix_gy8hznkx569v-7{list-style-type:none}.lst-kix_2z6b1ga5h3yk-3>li:before{content:"\0025cf  "}.lst-kix_2z6b1ga5h3yk-5>li:before{content:"\0025a0  "}ul.lst-kix_gy8hznkx569v-6{list-style-type:none}ul.lst-kix_gy8hznkx569v-1{list-style-type:none}.lst-kix_2z6b1ga5h3yk-2>li:before{content:"\0025a0  "}.lst-kix_2z6b1ga5h3yk-6>li:before{content:"\0025cf  "}ul.lst-kix_gy8hznkx569v-0{list-style-type:none}ul.lst-kix_gy8hznkx569v-3{list-style-type:none}ul.lst-kix_gy8hznkx569v-2{list-style-type:none}.lst-kix_2z6b1ga5h3yk-0>li:before{content:"\0025cf  "}.lst-kix_2z6b1ga5h3yk-8>li:before{content:"\0025a0  "}.lst-kix_gy8hznkx569v-7>li:before{content:"-  "}.lst-kix_2z6b1ga5h3yk-1>li:before{content:"\0025cb  "}.lst-kix_2z6b1ga5h3yk-7>li:before{content:"\0025cb  "}.lst-kix_gy8hznkx569v-8>li:before{content:"-  "}ul.lst-kix_gy8hznkx569v-8{list-style-type:none}.lst-kix_gy8hznkx569v-2>li:before{content:"-  "}.lst-kix_gy8hznkx569v-3>li:before{content:"-  "}ul.lst-kix_2z6b1ga5h3yk-8{list-style-type:none}.lst-kix_gy8hznkx569v-6>li:before{content:"-  "}ul.lst-kix_2z6b1ga5h3yk-6{list-style-type:none}ul.lst-kix_2z6b1ga5h3yk-7{list-style-type:none}.lst-kix_gy8hznkx569v-4>li:before{content:"-  "}.lst-kix_gy8hznkx569v-5>li:before{content:"-  "}ul.lst-kix_2z6b1ga5h3yk-0{list-style-type:none}ul.lst-kix_2z6b1ga5h3yk-1{list-style-type:none}ul.lst-kix_2z6b1ga5h3yk-4{list-style-type:none}ul.lst-kix_2z6b1ga5h3yk-5{list-style-type:none}ul.lst-kix_2z6b1ga5h3yk-2{list-style-type:none}ul.lst-kix_2z6b1ga5h3yk-3{list-style-type:none}.lst-kix_gy8hznkx569v-0>li:before{content:"-  "}.lst-kix_gy8hznkx569v-1>li:before{content:"-  "}ol{margin:0;padding:0}table td,table th{padding:0}.c7{margin-left:36pt;padding-top:3pt;padding-left:0pt;padding-bottom:12pt;line-height:1.15;orphans:2;widows:2;text-align:left}.c4{color:#000000;font-weight:400;text-decoration:none;vertical-align:baseline;font-size:12pt;font-family:"Consolas";font-style:normal}.c5{color:#000000;font-weight:400;text-decoration:none;vertical-align:baseline;font-size:11pt;font-family:"Arial";font-style:italic}.c8{padding-top:0pt;padding-bottom:0pt;line-height:1.15;orphans:2;widows:2;text-align:left}.c14{padding-top:3pt;padding-bottom:12pt;line-height:1.15;orphans:2;widows:2;text-align:left}.c1{padding-top:0pt;padding-bottom:12pt;line-height:1.15;orphans:2;widows:2;text-align:left}.c3{font-weight:400;text-decoration:none;vertical-align:baseline;font-family:"Arial";font-style:normal}.c11{font-weight:400;text-decoration:none;vertical-align:baseline;font-family:"Consolas";font-style:normal}.c12{background-color:#ffffff;max-width:487.3pt;padding:36pt 36pt 36pt 72pt}.c0{padding:0;margin:0}.c6{color:#000000;font-size:11pt}.c2{color:#24292e;font-size:12pt}.c13{margin-left:36pt;padding-left:0pt}.c9{height:11pt}.c10{font-weight:700}.title{padding-top:0pt;color:#000000;font-size:26pt;padding-bottom:3pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}.subtitle{padding-top:0pt;color:#666666;font-size:15pt;padding-bottom:16pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}li{color:#000000;font-size:11pt;font-family:"Arial"}p{margin:0;color:#000000;font-size:11pt;font-family:"Arial"}h1{padding-top:20pt;color:#000000;font-size:20pt;padding-bottom:6pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h2{padding-top:18pt;color:#000000;font-size:16pt;padding-bottom:6pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h3{padding-top:16pt;color:#434343;font-size:14pt;padding-bottom:4pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h4{padding-top:14pt;color:#666666;font-size:12pt;padding-bottom:4pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h5{padding-top:12pt;color:#666666;font-size:11pt;padding-bottom:4pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h6{padding-top:12pt;color:#666666;font-size:11pt;padding-bottom:4pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;font-style:italic;orphans:2;widows:2;text-align:left}</style></head><body class="c12"><p class="c8"><span class="c10">&#1044;&#1086;&#1084;&#1072;&#1096;&#1085;&#1086; 2. </span><span class="c5">&#1057;&#1090;&#1077;&#1082;, &#1086;&#1087;&#1072;&#1096;&#1082;&#1072; &#1080; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;</span></p><p class="c1 c9"><span class="c3 c2"></span></p><p class="c1"><span class="c3 c2">&#1053;&#1072;&#1087;&#1080;&#1096;&#1077;&#1090;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1072;, &#1082;&#1086;&#1103;&#1090;&#1086; &#1087;&#1088;&#1080;&#1077;&#1084;&#1072; &#1082;&#1072;&#1090;&#1086; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090; &#1086;&#1090; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1085;&#1080;&#1103; &#1088;&#1077;&#1076; &#1076;&#1074;&#1077; &#1080;&#1084;&#1077;&#1085;&#1072; &#1085;&#1072; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;&#1080; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;&#1077;. &#1055;&#1098;&#1088;&#1074;&#1080;&#1103;&#1090; &#1089;&#1098;&#1076;&#1098;&#1088;&#1078;&#1072; &ldquo;&#1082;&#1086;&#1084;&#1087;&#1088;&#1077;&#1089;&#1080;&#1088;&#1072;&#1085;&rdquo; &#1085;&#1080;&#1079;, &#1074;&#1098;&#1074; &#1074;&#1090;&#1086;&#1088;&#1080;&#1103; &#1074;&#1080;&#1077; &#1090;&#1088;&#1103;&#1073;&#1074;&#1072; &#1076;&#1072; &#1079;&#1072;&#1087;&#1080;&#1096;&#1077;&#1090;&#1077; &#1076;&#1077;&#1082;&#1086;&#1084;&#1087;&#1088;&#1077;&#1089;&#1080;&#1088;&#1072;&#1085;&#1072;&#1090;&#1072; &#1084;&#1091; &#1074;&#1077;&#1088;&#1089;&#1080;&#1103;. &#1040;&#1082;&#1086; &#1085;&#1080;&#1079;&#1098;&#1090; &#1085;&#1077; &#1077; &#1079;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085; &#1082;&#1086;&#1088;&#1077;&#1082;&#1090;&#1085;&#1086; &#1090;&#1088;&#1103;&#1073;&#1074;&#1072; &#1076;&#1072; &#1089;&#1098;&#1086;&#1073;&#1097;&#1080;&#1090;&#1077; &#1090;&#1086;&#1074;&#1072;.</span></p><p class="c1"><span class="c3 c2">&#1050;&#1086;&#1084;&#1087;&#1088;&#1077;&#1089;&#1080;&#1088;&#1072;&#1085;&#1080;&#1103;&#1090; &#1085;&#1080;&#1079; &#1089;&#1098;&#1076;&#1098;&#1088;&#1078;&#1072; 4 &#1074;&#1080;&#1076;&#1072; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1080;:</span></p><ul class="c0 lst-kix_2z6b1ga5h3yk-0 start"><li class="c1 c13"><span class="c3 c2">&#1057;&#1080;&#1084;&#1074;&#1086;&#1083;&#1080; (&#1074;&#1089;&#1103;&#1082;&#1072;&#1082;&#1074;&#1080; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1080;, &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1080; &#1086;&#1090; &#1076;&#1074;&#1086;&#1081;&#1085;&#1072; &#1082;&#1072;&#1074;&#1080;&#1095;&#1082;&#1072;, &#1089;&#1082;&#1086;&#1073;&#1080;, &#1094;&#1080;&#1092;&#1088;&#1080; &#1080; &#1085;&#1072;&#1082;&#1083;&#1086;&#1085;&#1077;&#1085;&#1072; &#1095;&#1077;&#1088;&#1090;&#1072; &lsquo;\&rsquo;)</span></li><li class="c1 c13"><span class="c2">&#1045;&#1082;&#1088;&#1072;&#1085;&#1080;&#1088;&#1072;&#1085;&#1080; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1080; - &#1085;&#1072;&#1082;&#1083;&#1086;&#1085;&#1077;&#1085;&#1072; &#1095;&#1077;&#1088;&#1090;&#1072;, &#1089;&#1083;&#1077;&#1076;&#1074;&#1072;&#1085;&#1072; &#1086;&#1090; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1083;&#1077;&#1085; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;. &#1058;&#1072;&#1082;&#1072; &#1074; &#1082;&#1086;&#1084;&#1087;&#1088;&#1077;&#1089;&#1080;&#1088;&#1072;&#1085;&#1080;&#1103;&#1090; &#1085;&#1080;&#1079; &#1084;&#1086;&#1078;&#1077; &#1076;&#1072; &#1089;&#1077; &#1089;&#1083;&#1086;&#1078;&#1072;&#1090; &#1089;&#1087;&#1077;&#1094;&#1080;&#1072;&#1083;&#1085;&#1080; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1080;. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;: o</span><span class="c2 c10">\k</span><span class="c2">s-&gt;o</span><span class="c2">k</span><span class="c2 c3">s.</span></li><li class="c7"><span class="c3 c2">&#1043;&#1088;&#1091;&#1087;&#1080;, &#1082;&#1086;&#1080;&#1090;&#1086; &#1079;&#1072;&#1087;&#1086;&#1095;&#1074;&#1072;&#1090; &#1089; &#1095;&#1080;&#1089;&#1083;&#1086; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1074;&#1072;&#1085;&#1086; &#1086;&#1090; &#1089;&#1082;&#1086;&#1073;&#1080;, &#1089;&#1098;&#1076;&#1098;&#1088;&#1078;&#1072;&#1097;&#1080; &#1082;&#1086;&#1084;&#1087;&#1088;&#1077;&#1089;&#1080;&#1088;&#1072;&#1085; &#1085;&#1080;&#1079;. &#1044;&#1077;&#1082;&#1086;&#1084;&#1087;&#1088;&#1077;&#1089;&#1080;&#1088;&#1072;&#1090; &#1089;&#1077; &#1082;&#1072;&#1090;&#1086; &#1089;&#1077; &#1076;&#1077;&#1082;&#1086;&#1084;&#1087;&#1088;&#1077;&#1089;&#1080;&#1088;&#1072; &#1085;&#1080;&#1079;&#1072; &#1074; &#1089;&#1082;&#1086;&#1073;&#1080;&#1090;&#1077; &#1080; &#1089;&#1077; &#1087;&#1086;&#1074;&#1090;&#1086;&#1088;&#1080; &#1090;&#1086;&#1083;&#1082;&#1086;&#1074;&#1072; &#1087;&#1098;&#1090;&#1080; &#1082;&#1086;&#1083;&#1082;&#1086;&#1090;&#1086; &#1077; &#1095;&#1080;&#1089;&#1083;&#1086;&#1090;&#1086;.</span></li><li class="c7"><span class="c3 c2">&#1057;&#1090;&#1088;&#1080;&#1085;&#1075;&#1086;&#1074;&#1077; - &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1085;&#1086;&#1089;&#1090; &#1086;&#1090; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1083;&#1085;&#1080; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1080;, &#1086;&#1075;&#1088;&#1072;&#1076;&#1077;&#1085;&#1080; &#1089; &#1076;&#1074;&#1086;&#1081;&#1085;&#1080; &#1082;&#1072;&#1074;&#1080;&#1095;&#1082;&#1080; - &#1087;&#1088;&#1077;&#1085;&#1072;&#1089;&#1103; &#1089;&#1077; &#1074; &#1076;&#1077;&#1082;&#1086;&#1084;&#1087;&#1088;&#1077;&#1089;&#1080;&#1088;&#1072;&#1085;&#1072;&#1090;&#1072; &#1074;&#1077;&#1088;&#1089;&#1080;&#1103; &#1085;&#1077;&#1087;&#1088;&#1086;&#1084;&#1077;&#1085;&#1077;&#1085;&#1072;, &#1085;&#1086; &#1073;&#1077;&#1079; &#1082;&#1072;&#1074;&#1080;&#1095;&#1082;&#1080;&#1090;&#1077;. &#1042; &#1090;&#1072;&#1079;&#1080; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1085;&#1086;&#1089;&#1090; &#1089;&#1077; &#1076;&#1086;&#1087;&#1091;&#1089;&#1082;&#1072;&#1090; &#1077;&#1082;&#1088;&#1072;&#1085;&#1080;&#1088;&#1072;&#1085;&#1080; &#1082;&#1072;&#1074;&#1080;&#1095;&#1082;&#1080;.</span></li></ul><p class="c14"><span class="c3 c2">&#1047;&#1072;&#1073;&#1077;&#1083;&#1077;&#1078;&#1082;&#1080;:</span></p><ul class="c0 lst-kix_gy8hznkx569v-0 start"><li class="c7"><span class="c3 c2">&#1042;&#1098;&#1074; &#1074;&#1072;&#1096;&#1072;&#1090;&#1072; &#1080;&#1084;&#1087;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103; &#1085;&#1103;&#1084;&#1072;&#1090;&#1077; &#1087;&#1088;&#1072;&#1074;&#1086; &#1076;&#1072; &#1087;&#1086;&#1083;&#1079;&#1074;&#1072;&#1090;&#1077; &#1088;&#1077;&#1082;&#1088;&#1091;&#1089;&#1080;&#1103;</span></li><li class="c7"><span class="c3 c2">&#1055;&#1072;&#1084;&#1077;&#1090;&#1090;&#1072; &#1079;&#1072;&#1077;&#1084;&#1072;&#1085;&#1072; &#1086;&#1090; &#1074;&#1072;&#1096;&#1072;&#1090;&#1072; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1072; &#1090;&#1088;&#1103;&#1073;&#1074;&#1072; &#1076;&#1072; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080; &#1089;&#1072;&#1084;&#1086; &#1086;&#1090; &#1076;&#1098;&#1083;&#1078;&#1080;&#1085;&#1072;&#1090;&#1072; &#1085;&#1072; &#1074;&#1093;&#1086;&#1076;&#1085;&#1080;&#1103;&#1090; &#1085;&#1080;&#1079; + &#1076;&#1098;&#1083;&#1073;&#1086;&#1095;&#1080;&#1085;&#1072;&#1090;&#1072; &#1085;&#1072; &#1085;&#1072;&#1081;-&#1076;&#1098;&#1083;&#1073;&#1086;&#1082;&#1086; &#1074;&#1083;&#1086;&#1078;&#1077;&#1085;&#1072;&#1090;&#1072; &#1075;&#1088;&#1091;&#1087;&#1072;. &#1040;&#1082;&#1086; &#1086;&#1090;&#1073;&#1077;&#1083;&#1077;&#1078;&#1080;&#1084; &#1076;&#1098;&#1083;&#1078;&#1080;&#1085;&#1072;&#1090;&#1072; &#1085;&#1072; &#1074;&#1093;&#1086;&#1076;&#1085;&#1080;&#1103;&#1090; &#1085;&#1080;&#1079; &#1089; N, &#1076;&#1098;&#1083;&#1073;&#1086;&#1095;&#1080;&#1085;&#1072;&#1090;&#1072; &#1085;&#1072; &#1085;&#1072;&#1081;-&#1076;&#1098;&#1083;&#1073;&#1086;&#1082;&#1086; &#1074;&#1083;&#1086;&#1078;&#1077;&#1085;&#1072;&#1090;&#1072; &#1075;&#1088;&#1091;&#1087;&#1072; &#1089; D &#1080; &#1076;&#1098;&#1083;&#1078;&#1080;&#1085;&#1072;&#1090;&#1072; &#1085;&#1072; &#1080;&#1079;&#1093;&#1086;&#1076;&#1085;&#1080;&#1103; (&#1076;&#1077;&#1082;&#1086;&#1084;&#1087;&#1088;&#1077;&#1089;&#1080;&#1088;&#1072;&#1085;) &#1085;&#1080;&#1079; &#1089; S, &#1090;&#1086; &#1074;&#1072;&#1096;&#1072;&#1090;&#1072; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1072; &#1090;&#1088;&#1103;&#1073;&#1074;&#1072; &#1076;&#1072; &#1079;&#1072;&#1077;&#1084;&#1072; &#1087;&#1072;&#1084;&#1077;&#1090; (N + D) * k, &#1082;&#1098;&#1076;&#1077;&#1090;&#1086; k &#1077; &#1082;&#1086;&#1085;&#1089;&#1090;&#1072;&#1085;&#1090;&#1072;.</span></li></ul><p class="c1"><span class="c3 c2">&#1055;&#1088;&#1080;&#1084;&#1077;&#1088;&#1080;:</span></p><p class="c8"><span class="c4">AABC -&gt; AABC</span></p><p class="c8"><span class="c4">&#1040;\\BC -&gt; A\BC</span></p><p class="c8"><span class="c4">R2(AB)3(Z) -&gt; RABABZZZ</span></p><p class="c8"><span class="c4">A&quot;3(Zs)&quot;3(Zs)-&gt; A3(Zs)ZsZsZs</span></p><p class="c8"><span class="c4">R2(A\2B)3(Z) -&gt; RA2BA2BZZZ</span></p><p class="c8"><span class="c4">AB12(X)2(B3(A)) -&gt; ABXXXXXXXXXXXXBAAABAAA</span></p><p class="c8"><span class="c4">AB12(X)2(B3(A&quot;2&#39;1&quot;)) -&gt; ABXXXXXXXXXXXXBA2&#39;1A2&#39;1A2&#39;1BA2&#39;1A2&#39;1A2&#39;1</span></p><p class="c8"><span class="c4">A&quot;\&quot;BC&quot; -&gt; A\&quot;BC</span></p><p class="c8 c9"><span class="c6 c11"></span></p><p class="c8 c9"><span class="c11 c6"></span></p><p class="c8 c9"><span class="c3 c6"></span></p></body></html>