<html><head><meta content="text/html; charset=UTF-8" http-equiv="content-type"><style type="text/css">ol{margin:0;padding:0}table td,table th{padding:0}.c4{padding-top:0pt;padding-bottom:0pt;line-height:1.15;orphans:2;widows:2;text-align:left;height:11pt}.c0{color:#000000;font-weight:400;text-decoration:none;vertical-align:baseline;font-size:11pt;font-family:"Arial";font-style:normal}.c7{padding-top:0pt;padding-bottom:0pt;line-height:1.15;orphans:2;widows:2;text-align:left}.c2{padding-top:0pt;padding-bottom:0pt;line-height:1.15;orphans:2;widows:2;text-align:justify}.c5{background-color:#ffffff;max-width:451.4pt;padding:72pt 72pt 72pt 72pt}.c3{font-weight:700}.c6{height:11pt}.c1{font-style:italic}.title{padding-top:0pt;color:#000000;font-size:26pt;padding-bottom:3pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}.subtitle{padding-top:0pt;color:#666666;font-size:15pt;padding-bottom:16pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}li{color:#000000;font-size:11pt;font-family:"Arial"}p{margin:0;color:#000000;font-size:11pt;font-family:"Arial"}h1{padding-top:20pt;color:#000000;font-size:20pt;padding-bottom:6pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h2{padding-top:18pt;color:#000000;font-size:16pt;padding-bottom:6pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h3{padding-top:16pt;color:#434343;font-size:14pt;padding-bottom:4pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h4{padding-top:14pt;color:#666666;font-size:12pt;padding-bottom:4pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h5{padding-top:12pt;color:#666666;font-size:11pt;padding-bottom:4pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;orphans:2;widows:2;text-align:left}h6{padding-top:12pt;color:#666666;font-size:11pt;padding-bottom:4pt;font-family:"Arial";line-height:1.15;page-break-after:avoid;font-style:italic;orphans:2;widows:2;text-align:left}</style></head><body class="c5"><p class="c2"><span class="c1">&#1053;&#1077;&#1095;&#1077;&#1090;&#1085;&#1086;</span><span class="c0">&nbsp;&#1076;&#1098;&#1088;&#1074;&#1086; &#1089; N &#1077;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072; &#1085;&#1072;&#1088;&#1080;&#1095;&#1072;&#1084;&#1077; &#1076;&#1098;&#1088;&#1074;&#1086;, &#1085;&#1072; &#1082;&#1086;&#1077;&#1090;&#1086; &#1074;&#1089;&#1080;&#1095;&#1082;&#1080;&#1090;&#1077; &#1077;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1080; &#1089;&#1072; &#1087;&#1098;&#1088;&#1074;&#1080;&#1090;&#1077; N &#1085;&#1077;&#1095;&#1077;&#1090;&#1085;&#1080; &#1095;&#1080;&#1089;&#1083;&#1072;: 1, 3, 5, 7, &hellip; &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1085;&#1077;&#1095;&#1077;&#1090;&#1085;&#1086; &#1076;&#1098;&#1088;&#1074;&#1086; &#1089; 5 &#1077;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072; &#1089;&#1098;&#1076;&#1098;&#1088;&#1078;&#1072; &#1095;&#1080;&#1089;&#1083;&#1072;&#1090;&#1072;: 1, 3, 5, 7, 9.</span></p><p class="c2 c6"><span class="c0"></span></p><p class="c2"><span class="c1">&#1043;&#1088;&#1072;&#1094;&#1080;&#1086;&#1079;&#1085;&#1086;</span><span>&nbsp;&#1076;&#1098;&#1088;&#1074;&#1086; &#1077; &#1090;&#1072;&#1082;&#1086;&#1074;&#1072; &#1076;&#1098;&#1088;&#1074;&#1086;, &#1079;&#1072; &#1082;&#1086;&#1077;&#1090;&#1086; &#1077; &#1074;&#1103;&#1088;&#1085;&#1086;, &#1095;&#1077; &#1090;&#1086; &#1077; </span><span class="c1">&#1085;&#1077;&#1095;&#1077;&#1090;&#1085;&#1086; </span><span class="c0">&#1080; &#1086;&#1089;&#1074;&#1077;&#1085; &#1090;&#1086;&#1074;&#1072; &#1074; &#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1086;&#1090;&#1086; &#1086;&#1090; &#1072;&#1073;&#1089;&#1086;&#1083;&#1102;&#1090;&#1085;&#1080;&#1090;&#1077; &#1088;&#1072;&#1079;&#1083;&#1080;&#1082;&#1080; &#1084;&#1077;&#1078;&#1076;&#1091; &#1089;&#1090;&#1086;&#1081;&#1085;&#1086;&#1089;&#1090;&#1090;&#1072; &#1085;&#1072; &#1074;&#1089;&#1077;&#1082;&#1080; &#1077;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090; &#1080; &#1073;&#1072;&#1097;&#1080;&#1085;&#1080;&#1103; &#1084;&#1091;, &#1085;&#1103;&#1084;&#1072; &#1087;&#1086;&#1074;&#1090;&#1086;&#1088;&#1077;&#1085;&#1080;&#1103;.</span></p><p class="c2 c6"><span class="c0"></span></p><p class="c2"><span class="c0">&#1045;&#1090;&#1086; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1079;&#1072; &#1076;&#1074;&#1077; &#1076;&#1098;&#1088;&#1074;&#1077;&#1090;&#1072; A &#1080; B:</span></p><p class="c7"><span style="overflow: hidden; display: inline-block; margin: 0.00px 0.00px; border: 0.00px solid #000000; transform: rotate(0.00rad) translateZ(0px); -webkit-transform: rotate(0.00rad) translateZ(0px); width: 267.50px; height: 160.85px;"><img alt="" src="images/image1.png" style="width: 267.50px; height: 160.85px; margin-left: 0.00px; margin-top: 0.00px; transform: rotate(0.00rad) translateZ(0px); -webkit-transform: rotate(0.00rad) translateZ(0px);" title=""></span><span style="overflow: hidden; display: inline-block; margin: 0.00px 0.00px; border: 0.00px solid #000000; transform: rotate(0.00rad) translateZ(0px); -webkit-transform: rotate(0.00rad) translateZ(0px); width: 123.00px; height: 220.18px;"><img alt="" src="images/image2.png" style="width: 123.00px; height: 220.18px; margin-left: 0.00px; margin-top: 0.00px; transform: rotate(0.00rad) translateZ(0px); -webkit-transform: rotate(0.00rad) translateZ(0px);" title=""></span></p><p class="c4"><span class="c0"></span></p><p class="c2"><span>&#1045;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1080;&#1090;&#1077; &#1080; &#1085;&#1072; &#1076;&#1074;&#1077;&#1090;&#1077; &#1076;&#1098;&#1088;&#1074;&#1077;&#1090;&#1072; &#1089;&#1072;: 1,3,5,7 &#1080; 9. &#1048; &#1076;&#1074;&#1077;&#1090;&#1077; &#1089;&#1072; </span><span class="c1">&#1085;&#1077;&#1095;&#1077;&#1090;&#1085;&#1080;</span><span class="c0">. &#1052;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1086;&#1090;&#1086; &#1086;&#1090; &#1072;&#1073;&#1089;&#1086;&#1083;&#1102;&#1090;&#1085;&#1080;&#1090;&#1077; &#1088;&#1072;&#1079;&#1083;&#1080;&#1082;&#1080; &#1085;&#1072; A &#1077; {2, 4, 6, 8}. &#1052;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1086;&#1090;&#1086; &#1086;&#1090; &#1072;&#1073;&#1089;&#1086;&#1083;&#1102;&#1090;&#1085;&#1080;&#1090;&#1077; &#1088;&#1072;&#1079;&#1083;&#1080;&#1082;&#1080; &#1085;&#1072; B &#1077; {4, 4, 6, 8}. &#1044;&#1098;&#1088;&#1074;&#1086; A &#1077; &#1075;&#1088;&#1072;&#1094;&#1080;&#1086;&#1079;&#1085;&#1086; &#1072; &#1076;&#1098;&#1088;&#1074;&#1086; B &#1085;&#1077; &#1077;.</span></p><p class="c2 c6"><span class="c0"></span></p><p class="c2"><span>&#1053;</span><span>&#1072;&#1087;&#1080;&#1096;&#1077;&#1090;&#1077; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103;, &#1082;&#1086;&#1103;&#1090;&#1086; &#1087;&#1088;&#1080;&#1077;&#1084;&#1072; &#1082;&#1086;&#1088;&#1077;&#1085;&#1072; &#1085;&#1072; &#1076;&#1098;&#1088;&#1074;&#1086; &#1089; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1083;&#1077;&#1085; &#1073;&#1088;&#1086;&#1081; &#1076;&#1077;&#1094;&#1072; &#1080; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1103;&#1074;&#1072; &#1076;&#1072;&#1083;&#1080; &#1090;&#1086; &#1077; &quot;</span><span class="c1">&#1075;&#1088;&#1072;&#1094;&#1080;&#1086;&#1079;&#1085;&#1086; &#1076;&#1098;&#1088;&#1074;&#1086;</span><span>&quot;.</span></p><p class="c2 c6"><span class="c0"></span></p><p class="c2"><span>&#1056;&#1077;&#1072;&#1083;&#1080;&#1079;&#1080;&#1088;&#1072;&#1081;&#1090;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1072;, &#1082;&#1086;&#1103;&#1090;&#1086; &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1074;&#1072; &#1087;&#1098;&#1090; &#1076;&#1086; &#1092;&#1072;&#1081;&#1083; &#1082;&#1072;&#1090;&#1086; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090; &#1085;&#1072; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1085;&#1080;&#1103;&#1090; &#1088;&#1077;&#1076;. &#1054;&#1090; &#1090;&#1086;&#1079;&#1080; &#1092;&#1072;&#1081;&#1083; &#1090;&#1103; &#1090;&#1088;&#1103;&#1073;&#1074;&#1072; &#1076;&#1072; &#1087;&#1088;&#1086;&#1095;&#1077;&#1090;&#1077;&#1090;&#1077; </span><span class="c3">&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1072;&#1090;&#1072; </span><span>&#1085;&#1072; &#1076;&#1098;&#1088;&#1074;&#1086; &#1089; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1083;&#1077;&#1085; &#1073;&#1088;&#1086;&#1081; &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1094;&#1080;. &#1057;&#1083;&#1077;&#1076; &#1090;&#1086;&#1074;&#1072; &#1090;&#1088;&#1103;&#1073;&#1074;&#1072; &#1076;&#1072; &#1089;&#1077; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1080; &#1076;&#1072;&#1083;&#1080; &#1074;&#1098;&#1074; &#1074;&#1098;&#1079;&#1083;&#1080;&#1090;&#1077; &#1085;&#1072; &#1090;&#1086;&#1074;&#1072; &#1079;&#1072;&#1076;&#1072;&#1076;&#1077;&#1085;&#1086; &#1076;&#1098;&#1088;&#1074;&#1086; &#1084;&#1086;&#1075;&#1072;&#1090; &#1076;&#1072; &#1073;&#1098;&#1076;&#1072;&#1090; &#1087;&#1086;&#1087;&#1098;&#1083;&#1085;&#1077;&#1085;&#1080; &#1095;&#1080;&#1089;&#1083;&#1072;, &#1090;&#1072;&#1082;&#1072; &#1095;&#1077; &#1076;&#1098;&#1088;&#1074;&#1086;&#1090;&#1086; &#1076;&#1072; &#1089;&#1090;&#1072;&#1085;&#1077; </span><span class="c1">&#1075;&#1088;&#1072;&#1094;&#1080;&#1086;&#1079;&#1085;&#1086;</span><span class="c0">, &#1085;&#1086; &#1073;&#1077;&#1079; &#1076;&#1072; &#1089;&#1077; &#1076;&#1086;&#1073;&#1072;&#1074;&#1103;&#1090; &#1080;&#1083;&#1080; &#1084;&#1072;&#1093;&#1072;&#1090; &#1074;&#1098;&#1079;&#1083;&#1080;. &#1040;&#1082;&#1086; &#1090;&#1086;&#1074;&#1072; &#1077; &#1074;&#1098;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1072;&#1096;&#1072;&#1090;&#1072; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1072; &#1090;&#1088;&#1103;&#1073;&#1074;&#1072; &#1076;&#1072; &#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1080; &#1085;&#1086;&#1074; &#1092;&#1072;&#1081;&#1083; &#1074; &#1082;&#1086;&#1081;&#1090;&#1086; &#1076;&#1072; &#1079;&#1072;&#1087;&#1080;&#1096;&#1077; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1086;&#1090;&#1086; &#1075;&#1088;&#1072;&#1094;&#1080;&#1086;&#1079;&#1085;&#1086; &#1076;&#1098;&#1088;&#1074;&#1086;. &#1040;&#1082;&#1086; &#1087;&#1086;&#1076;&#1072;&#1076;&#1077;&#1085;&#1086;&#1090;&#1086; &#1076;&#1098;&#1088;&#1074;&#1086; &#1085;&#1077; &#1084;&#1086;&#1078;&#1077; &#1076;&#1072; &#1073;&#1098;&#1076;&#1077; &#1087;&#1086;&#1087;&#1098;&#1083;&#1085;&#1077;&#1085;&#1086;, &#1090;&#1072;&#1082;&#1072; &#1095;&#1077; &#1076;&#1072; &#1077; &#1075;&#1088;&#1072;&#1094;&#1080;&#1086;&#1079;&#1085;&#1086;, &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1072;&#1090;&#1072; &nbsp;&#1074;&#1080; &#1090;&#1088;&#1103;&#1073;&#1074;&#1072; &#1076;&#1072; &#1080;&#1079;&#1074;&#1077;&#1076;&#1077; &#1089;&#1098;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077; &#1085;&#1072; &#1077;&#1082;&#1088;&#1072;&#1085;&#1072;.</span></p><p class="c2"><span class="c0">&#1042;&#1080;&#1077; &#1089;&#1072;&#1084;&#1080; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1076;&#1072; &#1080;&#1079;&#1073;&#1077;&#1088;&#1077;&#1090;&#1077; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1072; &#1085;&#1072; &#1092;&#1072;&#1081;&#1083;&#1072;. &#1054;&#1087;&#1080;&#1096;&#1077;&#1090;&#1077; &#1075;&#1086; &#1082;&#1072;&#1090;&#1086; &#1082;&#1086;&#1084;&#1077;&#1085;&#1090;&#1072;&#1088;.</span></p><p class="c2 c6"><span class="c0"></span></p></body></html>